music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
    def new
        # render json: params
        @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Cool album"], ["year", 2017], ["band_id", 2], ["live", "t"], ["created_at", "2017-10-27 21:04:44.155692"], ["updated_at", "2017-10-27 21:04:44.155692"]]
---
    def create
        album = Album.new(album_params)
        album.year = Time.now.year
        album.save