music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test_band"], ["created_at", "2017-10-27 20:35:27.384933"], ["updated_at", "2017-10-27 20:35:27.384933"]]
---
    def create
        band = Band.create(band_params)